export const regex = {
  phone:
    /^((\+[1-9]{1,4}[ -]?)|(\([0-9]{2,3}\)[ -]?)|([0-9]{2,4})[ -]?)*?[0-9]{3,4}[ -]?[0-9]{3,4}$/,
  vietnamese_character:
    /à|á|ạ|ả|ã|â|ầ|ấ|ậ|ẩ|ẫ|ă|ằ|ắ|ặ|ẳ|ẵ|è|é|ẹ|ẻ|ẽ|ê|ề|ế|ệ|ể|ễ|ì|í|ị|ỉ|ĩ|ò|ó|ọ|ỏ|õ|ô|ồ|ố|ộ|ổ|ỗ|ơ|ờ|ớ|ợ|ở|ỡ|ù|ú|ụ|ủ|ũ|ư|ừ|ứ|ự|ử|ữ|ỳ|ý|ỵ|ỷ|ỹ|đ/g,
  full_size_character:
    /[０-９！”＃＄％＆’（）＊＋、ー。…・：；＜＝＞？＠「￥｜〜」＾＿｀『』]+/g,
  email:
    /^$|^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  non_digit: /\D+/g,
  sepicial_character: /[ !"`'#%&,:;<>=@{}~«\$\(\)\*\+\/\\\?\[\]\^\|]+/g,
  only_number_and_characters: /^(?!\d*$|[a-z]*$)[a-z\d]+$/i,
  only_number_or_characters: /^[a-zA-Z0-9]+$/,
  time: /^([0-9]{2}:[0-9]{2}|[0-9]{1,4})$/,
};
